blog/app/controllers/admin/posts_controller.rb

INSERT INTO "posts" ("author", "created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Svetlin"], ["created_at", Mon, 29 Jul 2013 11:53:23 UTC +00:00], ["text", "---"], ["title", "A new post created from the Admin"], ["updated_at", Mon, 29 Jul 2013 11:53:23 UTC +00:00]]
---
	def create
		@post = Post.new(post_params)

		if @post.save