blog/app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 6
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 13
---

<% if @post.comments.empty? %>