blog/app/views/admin/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 6
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 6
---
<h2>Comments</h2>
<% if @post.comments.empty? %>