blog/app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "6"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "some message of comment"], ["commenter", "commenter"], ["created_at", Mon, 29 Jul 2013 08:52:41 UTC +00:00], ["post_id", 6], ["updated_at", Mon, 29 Jul 2013 08:52:41 UTC +00:00]]
---
  def create
    @post     = Post.find(params[:post_id])
    @comment  = @post.comments.build(params[:comment].permit(:commenter, :body))

    if @comment.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "6"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 6 AND "comments"."id" = ? LIMIT 1  [["id", "3"]]
---
  def destroy
   @post = Post.find(params[:post_id])
   @comment = @post.comments.find(params[:id]).destroy