blog/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 6
---
	def show
		@post = Post.find(params[:id])
    @number_of_comments = Comment.count()