rspec-rails/example/app/controllers/widgets_controller.rb

SELECT "widgets".* FROM "widgets"
---
  def index
    @widgets = Widget.all

SELECT "widgets".* FROM "widgets" WHERE "widgets"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @widget = Widget.find(params[:id])

SELECT "widgets".* FROM "widgets" WHERE "widgets"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @widget = Widget.find(params[:id])

INSERT INTO "widgets" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 01 Aug 2013 11:40:39 UTC +00:00], ["name", nil], ["updated_at", Thu, 01 Aug 2013 11:40:39 UTC +00:00]]
---
  def create
    @widget = Widget.new(params[:widget])

    respond_to do |format|
      if @widget.save

SELECT "widgets".* FROM "widgets" WHERE "widgets"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @widget = Widget.find(params[:id])

SELECT "widgets".* FROM "widgets" WHERE "widgets"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "widgets" WHERE "widgets"."id" = ?  [["id", 1]]
---
  def destroy
    @widget = Widget.find(params[:id])
    @widget.destroy